esp8266/Arduino/hardware/sam/system/libsam/cmsis/sam3xa/include/sam3x4g.h
/* ----------------------------------------------------------------------------
 *         SAM Software Package License 
 * ----------------------------------------------------------------------------
 * Copyright (c) 2011, Atmel Corporation
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Atmel's name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ----------------------------------------------------------------------------
 */

#ifndef _SAM3X4G_
#define _SAM3X4G_

/** \addtogroup SAM3X4G_definitions SAM3X4G definitions
  This file defines all structures and symbols for SAM3X4G:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#ifndef __ASSEMBLY__
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg; /**< Read only 32-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg; /**< Read only 32-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg; /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg; /**< Read-Write 32-bit register (volatile unsigned int) */
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM3X4G */
/* ************************************************************************** */
/** \addtogroup SAM3X4G_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M3 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M3 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M3 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M3 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M3 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M3 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M3 System Tick Interrupt       */
/******  SAM3X4G specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAM3X4G Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM3X4G Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM3X4G Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM3X4G Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM3X4G Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM3X4G Power Management Controller (PMC) */
  EFC0_IRQn            =  6, /**<  6 SAM3X4G Enhanced Flash Controller 0 (EFC0) */
  EFC1_IRQn            =  7, /**<  7 SAM3X4G Enhanced Flash Controller 1 (EFC1) */
  UART_IRQn            =  8, /**<  8 SAM3X4G Universal Asynchronous Receiver Transceiver (UART) */
  SMC_IRQn             =  9, /**<  9 SAM3X4G Static Memory Controller (SMC) */
  SDRAMC_IRQn          = 10, /**< 10 SAM3X4G Synchronous Dynamic RAM Controller (SDRAMC) */
  PIOA_IRQn            = 11, /**< 11 SAM3X4G Parallel I/O Controller A, (PIOA) */
  PIOB_IRQn            = 12, /**< 12 SAM3X4G Parallel I/O Controller B (PIOB) */
  PIOC_IRQn            = 13, /**< 13 SAM3X4G Parallel I/O Controller C (PIOC) */
  PIOD_IRQn            = 14, /**< 14 SAM3X4G Parallel I/O Controller D (PIOD) */
  PIOE_IRQn            = 15, /**< 15 SAM3X4G Parallel I/O Controller E (PIOE) */
  PIOF_IRQn            = 16, /**< 16 SAM3X4G Parallel I/O Controller F (PIOF) */
  USART0_IRQn          = 17, /**< 17 SAM3X4G USART 0 (USART0) */
  USART1_IRQn          = 18, /**< 18 SAM3X4G USART 1 (USART1) */
  USART2_IRQn          = 19, /**< 19 SAM3X4G USART 2 (USART2) */
  USART3_IRQn          = 20, /**< 20 SAM3X4G USART 3 (USART3) */
  HSMCI_IRQn           = 21, /**< 21 SAM3X4G Multimedia Card Interface (HSMCI) */
  TWI0_IRQn            = 22, /**< 22 SAM3X4G Two-Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 23, /**< 23 SAM3X4G Two-Wire Interface 1 (TWI1) */
  SPI0_IRQn            = 24, /**< 24 SAM3X4G Serial Peripheral Interface (SPI0) */
  SPI1_IRQn            = 25, /**< 25 SAM3X4G Serial Peripheral Interface (SPI1) */
  SSC_IRQn             = 26, /**< 26 SAM3X4G Synchronous Serial Controller (SSC) */
  TC0_IRQn             = 27, /**< 27 SAM3X4G Timer Counter 0 (TC0) */
  TC1_IRQn             = 28, /**< 28 SAM3X4G Timer Counter 1 (TC1) */
  TC2_IRQn             = 29, /**< 29 SAM3X4G Timer Counter 2 (TC2) */
  TC3_IRQn             = 30, /**< 30 SAM3X4G Timer Counter 3 (TC3) */
  TC4_IRQn             = 31, /**< 31 SAM3X4G Timer Counter 4 (TC4) */
  TC5_IRQn             = 32, /**< 32 SAM3X4G Timer Counter 5 (TC5) */
  TC6_IRQn             = 33, /**< 33 SAM3X4G Timer Counter 6 (TC6) */
  TC7_IRQn             = 34, /**< 34 SAM3X4G Timer Counter 7 (TC7) */
  TC8_IRQn             = 35, /**< 35 SAM3X4G Timer Counter 8 (TC8) */
  PWM_IRQn             = 36, /**< 36 SAM3X4G Pulse Width Modulation Controller (PWM) */
  ADC_IRQn             = 37, /**< 37 SAM3X4G ADC Controller (ADC) */
  DACC_IRQn            = 38, /**< 38 SAM3X4G DAC Controller (DACC) */
  DMAC_IRQn            = 39, /**< 39 SAM3X4G DMA Controller (DMAC) */
  UOTGHS_IRQn          = 40, /**< 40 SAM3X4G USB OTG High Speed (UOTGHS) */
  TRNG_IRQn            = 41, /**< 41 SAM3X4G True Random Number Generator (TRNG) */
  EMAC_IRQn            = 42, /**< 42 SAM3X4G Ethernet MAC (EMAC) */
  CAN0_IRQn            = 43, /**< 43 SAM3X4G CAN Controller 0 (CAN0) */
  CAN1_IRQn            = 44  /**< 44 SAM3X4G CAN Controller 1 (CAN1) */
} IRQn_Type;

/**
 * \brief Configuration of the Cortex-M3 Processor and Core Peripherals 
 */

#define __CM3_REV              0x0200 /**< SAM3X4G core revision number ([15:8] revision number, [7:0] patch number) */
#define __MPU_PRESENT          1      /**< SAM3X4G does provide a MPU */
#define __NVIC_PRIO_BITS       4      /**< SAM3X4G uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig 0      /**< Set to 1 if different SysTick Config is used */

